---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinEnable
source: html/14f8adba-f87f-3206-d6b2-a701d888f752.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodSecondaryPerlinEnable Property

The property labeled "Use perlin noise for secondary highlight" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodSecondaryPerlinEnable { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".